// SPDX-License-Identifier: GPL-2.0-or-later
/*
 * Copyright (c) 2015-2018 Western Digital Corporation or its affiliates.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston,
 * MA  02110-1301, USA.
 *
 *   Author: Chaitanya Kulkarni <chaitanya.kulkarni@hgst.com>,
 *           Dong Ho <dong.ho@hgst.com>,
 *           Jeff Lien <jeff.lien@wdc.com>
 *           Brandon Paupore <brandon.paupore@wdc.com>
 */
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <inttypes.h>
#include <errno.h>
#include <limits.h>
#include <fcntl.h>
#include <unistd.h>

#include "common.h"
#include "nvme.h"
#include "libnvme.h"
#include "plugin.h"
#include "linux/types.h"
#include "util/cleanup.h"
#include "util/types.h"
#include "nvme-print.h"

#define CREATE_CMD
#include "wdc-nvme.h"
#include "wdc-utils.h"
#include "wdc-nvme-cmds.h"


	SCAO_V1_EECE               = 56,	/* End to end corrected errors */
	SCAO_V1_EEDE               = 64,	/* End to end detected errors */
	SCAO_V1_EEUE               = 72,	/* End to end uncorrected errors */
	SCAO_V1_SDPU               = 80,	/* System data percent used */
	SCAO_V1_MNUDEC             = 84,	/* Min User data erase counts (TLC) */
	SCAO_V1_MXUDEC             = 92,	/* Max User data erase counts (TLC) */
	SCAO_V1_AVUDEC             = 100,	/* Average User data erase counts (TLC) */
	SCAO_V1_MNEC               = 108,	/* Min Erase counts (SLC) */
	SCAO_V1_MXEC               = 116,	/* Max Erase counts (SLC) */
	SCAO_V1_AVEC               = 124,	/* Average Erase counts (SLC) */
	SCAO_V1_PFCN               = 132,	/* Program fail count normalized */
	SCAO_V1_PFCR               = 134,	/* Program fail count raw */
	SCAO_V1_EFCN               = 140,	/* Erase fail count normalized */
	SCAO_V1_EFCR               = 142,	/* Erase fail count raw */
	SCAO_V1_PCEC               = 148,	/* PCIe correctable error count */
	SCAO_V1_PFBU               = 156,	/* Percent free blocks (User) */
	SCAO_V1_SVN                = 160,	/* Security Version Number */
	SCAO_V1_PFBS               = 168,	/* Percent free blocks (System) */
	SCAO_V1_DCC                = 172,	/* Deallocate Commands Completed */
	SCAO_V1_TNU                = 188,	/* Total Namespace Utilization */
	SCAO_V1_FCC                = 196,	/* Format NVM Commands Completed */
	SCAO_V1_BBPG               = 198,	/* Background Back-Pressure Gauge */
	SCAO_V1_SEEC               = 202,	/* Soft ECC error count */
	SCAO_V1_RFSC               = 210,	/* Refresh count */
	SCAO_V1_BSNBN              = 218,	/* Bad system nand blocks normalized */
	SCAO_V1_BSNBR              = 220,	/* Bad system nand blocks raw */
	SCAO_V1_EEST               = 226,	/* Endurance estimate */
	SCAO_V1_TTC                = 242,	/* Thermal throttling count */
	SCAO_V1_UIO                = 244,	/* Unaligned I/O */
	SCAO_V1_PMUR               = 252,	/* Physical media units read */
	SCAO_V1_RTOC               = 268,	/* Read command timeout count */
	SCAO_V1_WTOC               = 272,	/* Write command timeout count */
	SCAO_V1_TTOC               = 276,	/* Trim command timeout count */
	SCAO_V1_PLRC               = 284,	/* PCIe Link Retraining Count */
	SCAO_V1_PSCC               = 292,	/* Power State Change Count */
	SCAO_V1_MAVF               = 300,	/* Boot SSD major version field */
	SCAO_V1_MIVF               = 302,	/* Boot SSD minor version field */
	SCAO_V1_PVF                = 304,	/* Boot SSD point version field */
	SCAO_V1_EVF                = 306,	/* Boot SSD errata version field */
	SCAO_V1_FTLUS              = 308,	/* FTL Unit Size */
	SCAO_V1_TCGOS              = 312,	/* TCG Ownership Status */

	SCAO_V1_LPV                = 494,	/* Log page version - 0x0001 */
	SCAO_V1_LPG                = 496,	/* Log page GUID */
};

static __u8 ext_smart_guid[WDC_C0_GUID_LENGTH] = {
	0x65, 0x43, 0x88, 0x78, 0xAC, 0xD8, 0x78, 0xA1,
	0x66, 0x42, 0x1E, 0x0F, 0x92, 0xD7, 0x6D, 0xC4
};

struct __packed wdc_nvme_ext_smart_log {
	__u8  ext_smart_pmuwt[16];			/* 000 Physical media units written TLC */
	__u8  ext_smart_pmuws[16];			/* 016 Physical media units written SLC */
	__u8  ext_smart_bunbc[8];			/* 032 Bad user nand block count */
	__u64 ext_smart_xrc;				/* 040 XOR recovery count */
	__u64 ext_smart_urec;				/* 048 Uncorrectable read error count */
	__u64 ext_smart_eece;				/* 056 End to end corrected errors */
	__u64 ext_smart_eede;				/* 064 End to end detected errors */
	__u64 ext_smart_eeue;				/* 072 End to end uncorrected errors */
	__u8  ext_smart_sdpu;				/* 080 System data percent used */
	__u8  ext_smart_rsvd1[3];			/* 081 reserved */
	__u64 ext_smart_mnudec;				/* 084 Min User data erase counts (TLC) */
	__u64 ext_smart_mxudec;				/* 092 Max User data erase counts (TLC) */
	__u64 ext_smart_avudec;				/* 100 Average User data erase counts (TLC) */
	__u64 ext_smart_mnec;				/* 108 Min Erase counts (SLC) */
	__u64 ext_smart_mxec;				/* 116 Max Erase counts (SLC) */
	__u64 ext_smart_avec;				/* 124 Average Erase counts (SLC) */
	__u8  ext_smart_pfc[8];				/* 132 Program fail count */
	__u8  ext_smart_efc[8];				/* 140 Erase fail count */
	__u64 ext_smart_pcec;				/* 148 PCIe correctable error count */
	__u8  ext_smart_pfbu;				/* 156 Percent free blocks (User) */
	__u8  ext_smart_rsvd2[3];			/* 157 reserved */
	__u64 ext_smart_svn;				/* 160 Security Version Number */
	__u8  ext_smart_pfbs;				/* 168 Percent free blocks (System) */
	__u8  ext_smart_rsvd3[3];			/* 169 reserved */
	__u8  ext_smart_dcc[16];			/* 172 Deallocate Commands Completed */
	__u64 ext_smart_tnu;				/* 188 Total Namespace Utilization  */
	__u16 ext_smart_fcc;				/* 196 Format NVM Commands Completed */
	__u8  ext_smart_bbpg;				/* 198 Background Back-Pressure Gauge */
	__u8  ext_smart_rsvd4[3];			/* 199 reserved */
	__u64 ext_smart_seec;				/* 202 Soft ECC error count */
	__u64 ext_smart_rfsc;				/* 210 Refresh count */
	__u8  ext_smart_bsnbc[8];			/* 218 Bad system nand block count */
	__u8  ext_smart_eest[16];			/* 226 Endurance estimate */
	__u16 ext_smart_ttc;				/* 242 Thermal throttling count */
	__u64 ext_smart_uio;				/* 244 Unaligned I/O */
	__u8  ext_smart_pmur[16];			/* 252 Physical media units read */
	__u32 ext_smart_rtoc;				/* 268 Read command timeout count */
	__u32 ext_smart_wtoc;				/* 272 Write command timeout count */
	__u32 ext_smart_ttoc;				/* 276 Trim command timeout count */
	__u8  ext_smart_rsvd5[4];			/* 280 reserved */
	__u64 ext_smart_plrc;				/* 284 PCIe Link Retraining Count */
	__u64 ext_smart_pscc;				/* 292 Power State Change Count */
	__u16 ext_smart_maj;				/* 300 Boot SSD major version field */
	__u16 ext_smart_min;				/* 302 Boot SSD minor version field */
	__u16 ext_smart_pt;				/* 304 Boot SSD point version field */
	__u16 ext_smart_err;				/* 306 Boot SSD errata version field */
	__u32 ext_smart_ftlus;				/* 308 FTL Unit Size */
	__u32 ext_smart_tcgos;				/* 312 TCG Ownership Status */
	__u8  ext_smart_rsvd6[178];			/* 316 reserved */
	__u16 ext_smart_lpv;				/* 494 Log page version - 0x0001 */
	__u8  ext_smart_lpg[16];			/* 496 Log page GUID */
};

struct ocp_bad_nand_block_count {
	__u64 raw : 48;
	__u16 normalized : 16;
};

struct ocp_e2e_correction_count {
	__u32 detected;
	__u32 corrected;
};

struct ocp_user_data_erase_count {
	__u32 maximum;
	__u32 minimum;
};

struct ocp_thermal_status {
	__u8 num_events;
	__u8 current_status;
};

struct __packed ocp_dssd_specific_ver {
	__u8 errata_ver;
	__u16 point_ver;
	__u16 minor_ver;
	__u8 major_ver;
};

struct ocp_cloud_smart_log {
	__u8 physical_media_units_written[16];
	__u8 physical_media_units_read[16];
	struct ocp_bad_nand_block_count bad_user_nand_blocks;
	struct ocp_bad_nand_block_count bad_system_nand_blocks;
	__u64 xor_recovery_count;
	__u64 uncorrectable_read_error_count;
	__u64 soft_ecc_error_count;
	struct ocp_e2e_correction_count e2e_correction_counts;
	__u8 system_data_percent_used;
	__u64 refresh_counts : 56;
	struct ocp_user_data_erase_count user_data_erase_counts;
	struct ocp_thermal_status thermal_status;
	struct ocp_dssd_specific_ver dssd_specific_ver;
	__u64 pcie_correctable_error_count;
	__u32 incomplete_shutdowns;
	__u8 rsvd116[4];
	__u8 percent_free_blocks;
	__u8 rsvd121[7];
	__u16 capacitor_health;
	__u8 nvme_base_errata_ver;
	__u8 nvme_cmd_set_errata_ver;
	__u8 rsvd132[4];
	__u64 unaligned_io;
	__u64 security_version_number;
	__u64 total_nuse;
	__u8 plp_start_count[16];
	__u8 endurance_estimate[16];
	__u64 pcie_link_retraining_cnt;
	__u64 power_state_change_cnt;
	char  lowest_permitted_fw_rev[8];
	__u8 rsvd216[278];
	__u16 log_page_version;
	__u8 log_page_guid[16];
};

static __u8 scao_guid[WDC_C0_GUID_LENGTH] = {
	0xC5, 0xAF, 0x10, 0x28, 0xEA, 0xBF, 0xF2, 0xA4,
	0x9C, 0x4F, 0x6F, 0x7C, 0xC9, 0x14, 0xD5, 0xAF
};

enum {
	EOL_RBC                 = 76,	/* Realloc Block Count */
	EOL_ECCR                = 80,	/* ECC Rate */
	EOL_WRA                 = 84,	/* Write Amp */
	EOL_PLR                 = 88,	/* Percent Life Remaining */
	EOL_RSVBC               = 92,	/* Reserved Block Count */
	EOL_PFC                 = 96,	/* Program Fail Count */
	EOL_EFC                 = 100,	/* Erase Fail Count */
	EOL_RRER                = 108,	/* Raw Read Error Rate */
};

#define WDC_NVME_C6_GUID_LENGTH         16
#define WDC_NVME_GET_HW_REV_LOG_OPCODE  0xc6
#define WDC_NVME_HW_REV_LOG_PAGE_LEN    512

struct __packed wdc_nvme_hw_rev_log {
	__u8  hw_rev_gdr;           /*   0 Global Device HW Revision     */
	__u8  hw_rev_ar;            /*   1 ASIC HW Revision              */
	__u8  hw_rev_pbc_mc;        /*   2 PCB Manufacturer Code         */
	__u8  hw_rev_dram_mc;       /*   3 DRAM Manufacturer Code        */
	__u8  hw_rev_nand_mc;       /*   4 NAND Manufacturer Code        */
	__u8  hw_rev_pmic1_mc;      /*   5 PMIC 1 Manufacturer Code      */
	__u8  hw_rev_pmic2_mc;      /*   6 PMIC 2 Manufacturer Code      */
	__u8  hw_rev_c1_mc;         /*   7 Other Component 1 Manf Code   */
	__u8  hw_rev_c2_mc;         /*   8 Other Component 2 Manf Code   */
	__u8  hw_rev_c3_mc;         /*   9 Other Component 3 Manf Code   */
	__u8  hw_rev_c4_mc;         /*  10 Other Component 4 Manf Code   */
	__u8  hw_rev_c5_mc;         /*  11 Other Component 5 Manf Code   */
	__u8  hw_rev_c6_mc;         /*  12 Other Component 6 Manf Code   */
	__u8  hw_rev_c7_mc;         /*  13 Other Component 7 Manf Code   */
	__u8  hw_rev_c8_mc;         /*  14 Other Component 8 Manf Code   */
	__u8  hw_rev_c9_mc;         /*  15 Other Component 9 Manf Code   */
	__u8  hw_rev_rsrvd1[48];    /*  16 Reserved 48 bytes             */
	__u8  hw_rev_dev_mdi[16];   /*  64 Device Manf Detailed Info     */
	__u8  hw_rev_asic_di[16];   /*  80 ASIC Detailed Info            */
	__u8  hw_rev_pcb_di[16];    /*  96 PCB Detailed Info             */
	__u8  hw_rev_dram_di[16];   /* 112 DRAM Detailed Info            */
	__u8  hw_rev_nand_di[16];   /* 128 NAND Detailed Info            */
	__u8  hw_rev_pmic1_di[16];  /* 144 PMIC1 Detailed Info           */
	__u8  hw_rev_pmic2_di[16];  /* 160 PMIC2 Detailed Info           */
	__u8  hw_rev_c1_di[16];     /* 176 Component 1 Detailed Info     */
	__u8  hw_rev_c2_di[16];     /* 192 Component 2 Detailed Info     */
	__u8  hw_rev_c3_di[16];     /* 208 Component 3 Detailed Info     */
	__u8  hw_rev_c4_di[16];     /* 224 Component 4 Detailed Info     */
	__u8  hw_rev_c5_di[16];     /* 240 Component 5 Detailed Info     */
	__u8  hw_rev_c6_di[16];     /* 256 Component 6 Detailed Info     */
	__u8  hw_rev_c7_di[16];     /* 272 Component 7 Detailed Info     */
	__u8  hw_rev_c8_di[16];     /* 288 Component 8 Detailed Info     */
	__u8  hw_rev_c9_di[16];     /* 304 Component 9 Detailed Info     */
	__u8  hw_rev_sn[32];        /* 320 Serial Number                 */
	__u8  hw_rev_rsrvd2[142];   /* 352 Reserved 143 bytes            */
	__u16 hw_rev_version;       /* 494 Log Page Version              */
	__u8  hw_rev_guid[16];      /* 496 Log Page GUID                 */
};

static __u8 hw_rev_log_guid[WDC_NVME_C6_GUID_LENGTH] = {
	0xAA, 0xB0, 0x05, 0xF5, 0x13, 0x5E, 0x48, 0x15,
	0xAB, 0x89, 0x05, 0xBA, 0x8B, 0xE2, 0xBF, 0x3C
};

struct __packed WDC_DE_VU_FILE_META_DATA {
	__u8 fileName[WDC_DE_FILE_NAME_SIZE];
	__u16 fileID;
	__u64 fileSize;
};

struct WDC_DRIVE_ESSENTIALS {
	struct __packed WDC_DE_VU_FILE_META_DATA metaData;
	enum WDC_DRIVE_ESSENTIAL_TYPE essentialType;
};

struct WDC_DE_VU_LOG_DIRECTORY {
	struct WDC_DRIVE_ESSENTIALS *logEntry;		/* Caller to allocate memory       */
	__u32 maxNumLogEntries;				/* Caller to input memory allocated */
	__u32 numOfValidLogEntries;			/* API will output this value      */
};

struct WDC_DE_CSA_FEATURE_ID_LIST {
	enum NVME_FEATURE_IDENTIFIERS featureId;
	__u8 featureName[WDC_DE_GENERIC_BUFFER_SIZE];
};

struct tarfile_metadata {
	char fileName[MAX_PATH_LEN];
	int8_t bufferFolderPath[MAX_PATH_LEN];
	char bufferFolderName[MAX_PATH_LEN];
	char tarFileName[MAX_PATH_LEN];
	char tarFiles[MAX_PATH_LEN];
	char tarCmd[MAX_PATH_LEN+MAX_PATH_LEN];
	char currDir[MAX_PATH_LEN];
	UtilsTimeInfo timeInfo;
	uint8_t *timeString[MAX_PATH_LEN];
};

static struct WDC_DE_CSA_FEATURE_ID_LIST deFeatureIdList[] = {
	{0x00,                                  "Dummy Placeholder"},
	{FID_ARBITRATION,                       "Arbitration"},
	{FID_POWER_MANAGEMENT,                  "PowerMgmnt"},
	{FID_LBA_RANGE_TYPE,                    "LbaRangeType"},
	{FID_TEMPERATURE_THRESHOLD,             "TempThreshold"},
	{FID_ERROR_RECOVERY,                    "ErrorRecovery"},
	{FID_VOLATILE_WRITE_CACHE,              "VolatileWriteCache"},
	{FID_NUMBER_OF_QUEUES,                  "NumOfQueues"},
	{FID_INTERRUPT_COALESCING,              "InterruptCoalesing"},
	{FID_INTERRUPT_VECTOR_CONFIGURATION,    "InterruptVectorConfig"},
	{FID_WRITE_ATOMICITY,                   "WriteAtomicity"},
	{FID_ASYNCHRONOUS_EVENT_CONFIGURATION,  "AsynEventConfig"},
	{FID_AUTONOMOUS_POWER_STATE_TRANSITION, "AutonomousPowerState"},
};

enum NVME_VU_DE_LOGPAGE_NAMES {
	NVME_DE_LOGPAGE_E3 = 0x01,
	NVME_DE_LOGPAGE_C0 = 0x02
};

struct NVME_VU_DE_LOGPAGE_LIST {
	enum NVME_VU_DE_LOGPAGE_NAMES logPageName;
	__u32	logPageId;
	__u32	logPageLen;
	char	logPageIdStr[5];
};

struct WDC_NVME_DE_VU_LOGPAGES {
	enum NVME_VU_DE_LOGPAGE_NAMES vuLogPageReqd;
	__u32 numOfVULogPages;
};

static struct NVME_VU_DE_LOGPAGE_LIST deVULogPagesList[] = {
	{ NVME_DE_LOGPAGE_E3, 0xE3, 1072, "0xe3"},
	{ NVME_DE_LOGPAGE_C0, 0xC0, 512, "0xc0"}
};

enum {
	WDC_NVME_ADMIN_VUC_OPCODE_D2 = 0xD2,
	WDC_VUC_SUBOPCODE_VS_DRIVE_INFO_D2 = 0x0000010A,
	WDC_VUC_SUBOPCODE_LOG_PAGE_DIR_D2 = 0x00000105,
};

enum {
	NVME_LOG_NS_BASE			= 0x80,
	NVME_LOG_VS_BASE			= 0xC0,
};

/*drive_info struct*/
struct ocp_drive_info {
	__u32 hw_revision;
	__u32 ftl_unit_size;
};

/*get log page directory struct*/
struct log_page_directory {
	__u64 supported_lid_bitmap;
	__u64 rsvd;
	__u64 supported_ns_lid_bitmap;
	__u64 supported_vs_lid_bitmap;
};

/*set latency monitor feature */
struct __packed feature_latency_monitor {
	__u16 active_bucket_timer_threshold;
	__u8  active_threshold_a;
	__u8  active_threshold_b;
	__u8  active_threshold_c;
	__u8  active_threshold_d;
	__u16 active_latency_config;
	__u8  active_latency_minimum_window;
	__u16 debug_log_trigger_enable;
	__u8  discard_debug_log;
	__u8  latency_monitor_feature_enable;
	__u8  reserved[4083];
};

static int wdc_get_serial_name(struct nvme_dev *dev, char *file, size_t len, const char *suffix);
static int wdc_create_log_file(const char *file, const __u8 *drive_log_data,
			       __u32 drive_log_length);
static int wdc_do_clear_dump(struct nvme_dev *dev, __u8 opcode, __u32 cdw12);
static int wdc_do_dump(struct nvme_dev *dev, __u32 opcode, __u32 data_len, __u32 cdw12,
		       const char *file, __u32 xfer_size);
static int wdc_do_crash_dump(struct nvme_dev *dev, char *file, int type);
static int wdc_crash_dump(struct nvme_dev *dev, const char *file, int type);
static int wdc_get_crash_dump(int argc, char **argv, struct command *command,
			      struct plugin *plugin);
static int wdc_do_drive_log(struct nvme_dev *dev, const char *file);
static int wdc_drive_log(int argc, char **argv, struct command *command, struct plugin *plugin);
static const char *wdc_purge_mon_status_to_string(__u32 status);
static int wdc_purge(int argc, char **argv, struct command *command, struct plugin *plugin);
static int wdc_purge_monitor(int argc, char **argv, struct command *command, struct plugin *plugin);
static bool wdc_nvme_check_supported_log_page(nvme_root_t r,
		struct nvme_dev *dev,
		__u8 log_id,
		__u8 uuid_index);
static int wdc_clear_pcie_correctable_errors(int argc, char **argv, struct command *command,
					     struct plugin *plugin);
static int wdc_do_drive_essentials(nvme_root_t r, struct nvme_dev *dev, char *dir, char *key);
static int wdc_drive_essentials(int argc, char **argv, struct command *command,
				struct plugin *plugin);
static int wdc_drive_status(int argc, char **argv, struct command *command, struct plugin *plugin);
static int wdc_clear_assert_dump(int argc, char **argv, struct command *command,
				 struct plugin *plugin);
static int wdc_drive_resize(int argc, char **argv, struct command *command, struct plugin *plugin);
static int wdc_do_drive_resize(struct nvme_dev *dev, uint64_t new_size);
static int wdc_namespace_resize(int argc, char **argv, struct command *command,
				struct plugin *plugin);
static int wdc_do_namespace_resize(struct nvme_dev *dev, __u32 nsid, __u32 op_option);
static int wdc_reason_identifier(int argc, char **argv, struct command *command,
				 struct plugin *plugin);
static int wdc_do_get_reason_id(struct nvme_dev *dev, const char *file, int log_id);
static int wdc_save_reason_id(struct nvme_dev *dev, __u8 *rsn_ident,  int size);
static int wdc_clear_reason_id(struct nvme_dev *dev);
static int wdc_log_page_directory(int argc, char **argv, struct command *command,
				  struct plugin *plugin);
static int wdc_do_drive_info(struct nvme_dev *dev, __u32 *result);
static int wdc_vs_drive_info(int argc, char **argv, struct command *command, struct plugin *plugin);
static int wdc_vs_temperature_stats(int argc, char **argv, struct command *command,
				    struct plugin *plugin);
static __u64 wdc_get_enc_drive_capabilities(nvme_root_t r, struct nvme_dev *dev);
static int wdc_enc_get_nic_log(struct nvme_dev *dev, __u8 log_id, __u32 xfer_size, __u32 data_len,
			       FILE *out);
static int wdc_enc_submit_move_data(struct nvme_dev *dev, char *cmd, int len, int xfer_size,
				    FILE *out, int data_id, int cdw14, int cdw15);
static bool get_dev_mgment_cbs_data(nvme_root_t r, struct nvme_dev *dev, __u8 log_id,
				    void **cbs_data);
static __u32 wdc_get_fw_cust_id(nvme_root_t r, struct nvme_dev *dev);
static int wdc_print_c0_cloud_attr_log(void *data,
		int fmt,
		struct nvme_dev *dev);
static int wdc_print_c0_eol_log(void *data, int fmt);
static void wdc_show_cloud_smart_log_normal(struct ocp_cloud_smart_log *log,
		struct nvme_dev *dev);
static void wdc_show_cloud_smart_log_json(struct ocp_cloud_smart_log *log);

/* Drive log data size */
struct wdc_log_size {
	__le32	log_size;
};

/* E6 log header */
struct wdc_e6_log_hdr {
	__le32  eye_catcher;
	__u8	log_size[4];
};

/* DUI log header */
struct wdc_dui_log_section {
	__le16	section_type;
	__le16	reserved;
	__le32	section_size;
};

/* DUI log header V2 */
struct __packed wdc_dui_log_section_v2 {
	__le16	section_type;
	__le16	data_area_id;
	__le64	section_size;
};

/* DUI log header V4 */
struct wdc_dui_log_section_v4 {
	__le16	section_type;
	__u8	data_area_id;
	__u8    reserved;
	__le32	section_size_sectors;
};

struct wdc_dui_log_hdr {
	__u8    telemetry_hdr[512];
	__le16	hdr_version;
	__le16	section_count;
	__le32	log_size;
	struct	wdc_dui_log_section log_section[WDC_NVME_DUI_MAX_SECTION];
	__u8    log_data[40];
};

struct __packed wdc_dui_log_hdr_v2 {
	__u8    telemetry_hdr[512];
	__u8	hdr_version;
	__u8    product_id;
	__le16	section_count;
	__le64	log_size;
	struct	wdc_dui_log_section_v2 log_section[WDC_NVME_DUI_MAX_SECTION_V2];
	__u8    log_data[40];
};

struct __packed wdc_dui_log_hdr_v3 {
	__u8    telemetry_hdr[512];
	__u8	hdr_version;
	__u8    product_id;
	__le16	section_count;
	__le64	log_size;
	struct	wdc_dui_log_section_v2 log_section[WDC_NVME_DUI_MAX_SECTION_V3];
	__u8    securityNonce[36];
	__u8    log_data[40];
};

struct __packed wdc_dui_log_hdr_v4 {
	__u8    telemetry_hdr[512];
	__u8	hdr_version;
	__u8    product_id;
	__le16	section_count;
	__le32	log_size_sectors;
	struct	wdc_dui_log_section_v4 log_section[WDC_NVME_DUI_MAX_SECTION];
	__u8    log_data[40];
};

/* Purge monitor response */
struct wdc_nvme_purge_monitor_data {
	__le16 rsvd1;
	__le16 rsvd2;
	__le16 first_erase_failure_cnt;
	__le16 second_erase_failure_cnt;
	__le16 rsvd3;
	__le16 programm_failure_cnt;
	__le32 rsvd4;
	__le32 rsvd5;
	__le32 entire_progress_total;
	__le32 entire_progress_current;
	__u8 rsvd6[14];
};

/* Additional Smart Log */
struct wdc_log_page_header {
	uint8_t	num_subpages;
	uint8_t	reserved;
	__le16	total_log_size;
};

struct wdc_log_page_subpage_header {
	uint8_t	spcode;
	uint8_t	pcset;
	__le16	subpage_length;
};

struct wdc_ssd_perf_stats {
	__le64	hr_cmds;		/* Host Read Commands			*/
	__le64	hr_blks;		/* Host Read Blocks			*/
	__le64	hr_ch_cmds;		/* Host Read Cache Hit Commands		*/
	__le64	hr_ch_blks;		/* Host Read Cache Hit Blocks		*/
	__le64	hr_st_cmds;		/* Host Read Stalled Commands		*/
	__le64	hw_cmds;		/* Host Write Commands			*/
	__le64	hw_blks;		/* Host Write Blocks			*/
	__le64	hw_os_cmds;		/* Host Write Odd Start Commands	*/
	__le64	hw_oe_cmds;		/* Host Write Odd End Commands		*/
	__le64	hw_st_cmds;		/* Host Write Commands Stalled		*/
	__le64	nr_cmds;		/* NAND Read Commands			*/
	__le64	nr_blks;		/* NAND Read Blocks			*/
	__le64	nw_cmds;		/* NAND Write Commands			*/
	__le64	nw_blks;		/* NAND Write Blocks			*/
	__le64	nrbw;			/* NAND Read Before Write		*/
};

/* Additional C2 Log Page */
struct wdc_c2_log_page_header {
	__le32	length;
	__le32	version;
};

struct wdc_c2_log_subpage_header {
	__le32	length;
	__le32	entry_id;
	__le32	data;
};

struct wdc_c2_cbs_data {
	__le32	length;
	__u8	data[];
};

struct __packed wdc_bd_ca_log_format {
	__u8	field_id;
	__u8	reserved1[2];
	__u8	normalized_value;
	__u8	raw_value[8];
};

#define WDC_LATENCY_LOG_BUCKET_READ         3
#define WDC_LATENCY_LOG_BUCKET_WRITE        2
#define WDC_LATENCY_LOG_BUCKET_TRIM         1
#define WDC_LATENCY_LOG_BUCKET_RESERVED     0

#define WDC_LATENCY_LOG_MEASURED_LAT_READ   2
#define WDC_LATENCY_LOG_MEASURED_LAT_WRITE  1
#define WDC_LATENCY_LOG_MEASURED_LAT_TRIM   0

struct __packed wdc_ssd_latency_monitor_log {
	__u8    feature_status;                         /* 0x00 */
	__u8    rsvd1;                                  /* 0x01 */
	__le16  active_bucket_timer;                    /* 0x02 */
	__le16  active_bucket_timer_threshold;          /* 0x04 */
	__u8    active_threshold_a;                     /* 0x06 */
	__u8    active_threshold_b;                     /* 0x07 */
	__u8    active_threshold_c;                     /* 0x08 */
	__u8    active_threshold_d;                     /* 0x09 */
	__le16  active_latency_config;                  /* 0x0A */
	__u8    active_latency_min_window;              /* 0x0C */
	__u8    rsvd2[0x13];                            /* 0x0D */

	__le32  active_bucket_counter[4][4];            /* 0x20 - 0x5F */
	__le64  active_latency_timestamp[4][3];         /* 0x60 - 0xBF */
	__le16  active_measured_latency[4][3];          /* 0xC0 - 0xD7 */
	__le16  active_latency_stamp_units;             /* 0xD8 */
	__u8    rsvd3[0x16];                            /* 0xDA */

	__le32  static_bucket_counter[4][4] ;           /* 0xF0  - 0x12F */
	__le64  static_latency_timestamp[4][3];         /* 0x130 - 0x18F */
	__le16  static_measured_latency[4][3];          /* 0x190 - 0x1A7 */
	__le16  static_latency_stamp_units;             /* 0x1A8 */
	__u8    rsvd4[10];                              /* 0x1AA */

	__u8    debug_telemetry_log_size[12];           /* 0x1B4 */
	__le16  debug_log_trigger_enable;               /* 0x1C0 */
	__le16  debug_log_measured_latency;             /* 0x1C2 */
	__le64  debug_log_latency_stamp;                /* 0x1C4 */
	__le16  debug_log_ptr;                          /* 0x1CC */
	__le16  debug_log_counter_trigger;              /* 0x1CE */
	__u8    debug_log_stamp_units;                  /* 0x1D0 */
	__u8    rsvd5[0x1D];                            /* 0x1D1 */

	__le16  log_page_version;                       /* 0x1EE */
	__u8    log_page_guid[0x10];                    /* 0x1F0 */
};

struct __packed wdc_ssd_ca_perf_stats {
	__le64  nand_bytes_wr_lo;                       /* 0x00 - NAND Bytes Written lo            */
	__le64  nand_bytes_wr_hi;                       /* 0x08 - NAND Bytes Written hi            */
	__le64  nand_bytes_rd_lo;                       /* 0x10 - NAND Bytes Read lo               */
	__le64  nand_bytes_rd_hi;                       /* 0x18 - NAND Bytes Read hi               */
	__le64  nand_bad_block;                         /* 0x20 - NAND Bad Block Count             */
	__le64  uncorr_read_count;                      /* 0x28 - Uncorrectable Read Count         */
	__le64  ecc_error_count;                        /* 0x30 - Soft ECC Error Count             */
	__le32  ssd_detect_count;                       /* 0x38 - SSD End to End Detection Count   */
	__le32  ssd_correct_count;                      /* 0x3C - SSD End to End Correction Count  */
	__u8    data_percent_used;                      /* 0x40 - System Data Percent Used         */
	__le32  data_erase_max;                         /* 0x41 - User Data Erase Counts           */
	__le32  data_erase_min;                         /* 0x45 - User Data Erase Counts           */
	__le64  refresh_count;                          /* 0x49 - Refresh Count                    */
	__le64  program_fail;                           /* 0x51 - Program Fail Count               */
	__le64  user_erase_fail;                        /* 0x59 - User Data Erase Fail Count       */
	__le64  system_erase_fail;                      /* 0x61 - System Area Erase Fail Count     */
	__u8    thermal_throttle_status;                /* 0x69 - Thermal Throttling Status        */
	__u8    thermal_throttle_count;                 /* 0x6A - Thermal Throttling Count         */
	__le64  pcie_corr_error;                        /* 0x6B - pcie Correctable Error Count     */
	__le32  incomplete_shutdown_count;              /* 0x73 - Incomplete Shutdown Count        */
	__u8    percent_free_blocks;                    /* 0x77 - Percent Free Blocks              */
	__u8    rsvd[392];                              /* 0x78 - Reserved bytes 120-511           */
};

struct __packed wdc_ssd_d0_smart_log {
	__le32  smart_log_page_header;                 /* 0x00 - Smart Log Page Header                      */
	__le32  lifetime_realloc_erase_block_count;    /* 0x04 - Lifetime reallocated erase block count     */
	__le32  lifetime_power_on_hours;               /* 0x08 - Lifetime power on hours                    */
	__le32  lifetime_uecc_count;                   /* 0x0C - Lifetime UECC count                        */
	__le32  lifetime_wrt_amp_factor;               /* 0x10 - Lifetime write amplification factor        */
	__le32  trailing_hr_wrt_amp_factor;            /* 0x14 - Trailing hour write amplification factor   */
	__le32  reserve_erase_block_count;             /* 0x18 - Reserve erase block count                  */
	__le32  lifetime_program_fail_count;           /* 0x1C - Lifetime program fail count                */
	__le32  lifetime_block_erase_fail_count;       /* 0x20 - Lifetime block erase fail count            */
	__le32  lifetime_die_failure_count;            /* 0x24 - Lifetime die failure count                 */
	__le32  lifetime_link_rate_downgrade_count;    /* 0x28 - Lifetime link rate downgrade count         */
	__le32  lifetime_clean_shutdown_count;         /* 0x2C - Lifetime clean shutdown count on power loss */
	__le32  lifetime_unclean_shutdown_count;       /* 0x30 - Lifetime unclean shutdowns on power loss   */
	__le32  current_temp;                          /* 0x34 - Current temperature                        */
	__le32  max_recorded_temp;                     /* 0x38 - Max recorded temperature                   */
	__le32  lifetime_retired_block_count;          /* 0x3C - Lifetime retired block count               */
	__le32  lifetime_read_disturb_realloc_events;  /* 0x40 - Lifetime read disturb reallocation events  */
	__le64  lifetime_nand_writes;                  /* 0x44 - Lifetime NAND write Lpages                 */
	__le32  capacitor_health;                      /* 0x4C - Capacitor health                           */
	__le64  lifetime_user_writes;                  /* 0x50 - Lifetime user writes                       */
	__le64  lifetime_user_reads;                   /* 0x58 - Lifetime user reads                        */
	__le32  lifetime_thermal_throttle_act;         /* 0x60 - Lifetime thermal throttle activations      */
	__le32  percentage_pe_cycles_remaining;        /* 0x64 - Percentage of P/E cycles remaining         */
	__u8    rsvd[408];                             /* 0x68 - 408 Reserved bytes                         */
};

#define WDC_OCP_C1_GUID_LENGTH              16
#define WDC_ERROR_REC_LOG_BUF_LEN          512
#define WDC_ERROR_REC_LOG_ID              0xC1

struct __packed wdc_ocp_c1_error_recovery_log {
	__le16  panic_reset_wait_time;              /* 000 - Panic Reset Wait Time               */
	__u8    panic_reset_action;                 /* 002 - Panic Reset Action                  */
	__u8    dev_recovery_action1;               /* 003 - Device Recovery Action 1            */
	__le64  panic_id;                           /* 004 - Panic ID                            */
	__le32  dev_capabilities;                   /* 012 - Device Capabilities                 */
	__u8    vs_recovery_opc;                    /* 016 - Vendor Specific Recovery Opcode     */
	__u8    rsvd1[3];                           /* 017 - 3 Reserved Bytes                    */
	__le32  vs_cmd_cdw12;                       /* 020 - Vendor Specific Command CDW12       */
	__le32  vs_cmd_cdw13;                       /* 024 - Vendor Specific Command CDW13       */
	__u8    vs_cmd_to;                          /* 028 - Vendor Specific Command Timeout V2  */
	__u8    dev_recovery_action2;               /* 029 - Device Recovery Action 2 V2         */
	__u8    dev_recovery_action2_to;            /* 030 - Device Recovery Action 2 Timeout V2 */
	__u8    panic_count;                        /* 031 - Number of panics encountered        */
	__le64  prev_panic_ids[4];                  /* 032 - 063 Previous Panic ID's             */
	__u8    rsvd2[430];                         /* 064 - 493 Reserved Bytes                  */
	                                            /* 430 reserved bytes aligns with the rest   */
	                                            /* of the data structure.  The size of 463   */
	                                            /* bytes mentioned in the OCP spec           */
	                                            /* (version 2.5) would not fit here.         */
	__le16  log_page_version;                   /* 494 - Log Page Version                    */
	__u8    log_page_guid[WDC_OCP_C1_GUID_LENGTH]; /* 496 - Log Page GUID                    */
};

static __u8 wdc_ocp_c1_guid[WDC_OCP_C1_GUID_LENGTH]    = { 0x44, 0xD9, 0x31, 0x21, 0xFE, 0x30, 0x34, 0xAE,
		0xAB, 0x4D, 0xFD, 0x3D, 0xBA, 0x83, 0x19, 0x5A };

/* NAND Stats */
struct __packed wdc_nand_stats {
	__u8		nand_write_tlc[16];
	__u8		nand_write_slc[16];
	__le32		nand_prog_failure;
	__le32		nand_erase_failure;
	__le32		bad_block_count;
	__le64		nand_rec_trigger_event;
	__le64		e2e_error_counter;
	__le64		successful_ns_resize_event;
	__u8		rsvd[442];
	__u16		log_page_version;
};

struct __packed wdc_nand_stats_V3 {
	__u8		nand_write_tlc[16];
	__u8		nand_write_slc[16];
	__u8		bad_nand_block_count[8];
	__le64		xor_recovery_count;
	__le64		uecc_read_error_count;
	__u8		ssd_correction_counts[16];
	__u8		percent_life_used;
	__le64		user_data_erase_counts[4];
	__u8		program_fail_count[8];
	__u8		erase_fail_count[8];
	__le64		correctable_error_count;
	__u8		percent_free_blocks_user;
	__le64		security_version_number;
	__u8		percent_free_blocks_system;
	__u8		trim_completions[25];
	__u8		back_pressure_guage;
	__le64		soft_ecc_error_count;
	__le64		refresh_count;
	__u8		bad_sys_nand_block_count[8];
	__u8		endurance_estimate[16];
	__u8		thermal_throttling_st_ct[2];
	__le64		unaligned_IO;
	__u8		physical_media_units[16];
	__u8		reserved[279];
	__u16		log_page_version;
};

struct wdc_vs_pcie_stats {
	__le64 unsupportedRequestErrorCount;
	__le64 ecrcErrorStatusCount;
	__le64 malformedTlpStatusCount;
	__le64 receiverOverflowStatusCount;
	__le64 unexpectedCmpltnStatusCount;
	__le64 completeAbortStatusCount;
	__le64 cmpltnTimoutStatusCount;
	__le64 flowControlErrorStatusCount;
	__le64 poisonedTlpStatusCount;
	__le64 dLinkPrtclErrorStatusCount;
	__le64 advsryNFatalErrStatusCount;
	__le64 replayTimerToStatusCount;
	__le64 replayNumRolloverStCount;
	__le64 badDllpStatusCount;
	__le64 badTlpStatusCount;
	__le64 receiverErrStatusCount;
	__u8 reserved1[384];
};

struct wdc_fw_act_history_log_hdr {
	__le32 eye_catcher;
	__u8 version;
	__u8 reserved1;
	__u8 num_entries;
	__u8 reserved2;
	__le32 entry_size;
	__le32 reserved3;
};

struct wdc_fw_act_history_log_entry {
	__le32 entry_num;
	__le32 power_cycle_count;
	__le64 power_on_seconds;
	__le64 previous_fw_version;
	__le64 new_fw_version;
	__u8 slot_number;
	__u8 commit_action_type;
	__le16 result;
	__u8 reserved[12];
};

struct __packed wdc_fw_act_history_log_entry_c2 {
	__u8		entry_version_num;
	__u8		entry_len;
	__le16		reserved;
	__le16		fw_act_hist_entries;
	__le64		timestamp;
	__u8		reserved2[8];
	__le64		power_cycle_count;
	__le64		previous_fw_version;
	__le64		current_fw_version;
	__u8		slot_number;
	__u8		commit_action_type;
	__le16		result;
	__u8		reserved3[14];
};

struct __packed wdc_fw_act_history_log_format_c2 {
	__u8		log_identifier;
	__u8		reserved[3];
	__le32		num_entries;
	struct		wdc_fw_act_history_log_entry_c2 entry[WDC_MAX_NUM_ACT_HIST_ENTRIES];
	__u8		reserved2[2790];
	__le16		log_page_version;
	__u8		log_page_guid[WDC_C2_GUID_LENGTH];
};

static __u8 ocp_C2_guid[WDC_C2_GUID_LENGTH] = {
	0x6D, 0x79, 0x9A, 0x76, 0xB4, 0xDA, 0xF6, 0xA3,
	0xE2, 0x4D, 0xB2, 0x8A, 0xAC, 0xF3, 0x1C, 0xD1
};

#define WDC_OCP_C4_GUID_LENGTH              16
#define WDC_DEV_CAP_LOG_BUF_LEN           4096
#define WDC_DEV_CAP_LOG_ID                0xC4
#define WDC_DEV_CAP_LOG_VERSION           0001
#define WDC_OCP_C4_NUM_PS_DESCR            127

struct __packed wdc_ocp_C4_dev_cap_log {
	__le16  num_pcie_ports;                        /* 0000 - Number of PCI Express Ports         */
	__le16  oob_mgmt_support;                      /* 0002 - OOB Management Interfaces Supported */
	__le16  wrt_zeros_support;                     /* 0004 - Write Zeros Command Support        */
	__le16  sanitize_support;                      /* 0006 - Sanitize Command Support            */
	__le16  dsm_support;                           /* 0008 - Dataset Management Command Support  */
	__le16  wrt_uncor_support;                     /* 0010 - Write Uncorrectable Command Support */
	__le16  fused_support;                         /* 0012 - Fused Operation Support             */
	__le16  min_dssd_ps;                           /* 0014 - Minimum Valid DSSD Power State      */
	__u8    rsvd1;                                 /* 0016 - Reserved must be cleared to zero    */
	__u8    dssd_ps_descr[WDC_OCP_C4_NUM_PS_DESCR];/* 0017 - DSSD Power State Descriptors        */
	__u8    rsvd2[3934];                           /* 0144 - Reserved must be cleared to zero    */
	__le16  log_page_version;                      /* 4078 - Log Page Version                    */
	__u8    log_page_guid[WDC_OCP_C4_GUID_LENGTH]; /* 4080 - Log Page GUID                       */
};

static __u8 wdc_ocp_c4_guid[WDC_OCP_C4_GUID_LENGTH]  = {
	0x97, 0x42, 0x05, 0x0D, 0xD1, 0xE1, 0xC9, 0x98,
	0x5D, 0x49, 0x58, 0x4B, 0x91, 0x3C, 0x05, 0xB7
};

#define WDC_OCP_C5_GUID_LENGTH              16
#define WDC_UNSUPPORTED_REQS_LOG_BUF_LEN  4096
#define WDC_UNSUPPORTED_REQS_LOG_ID       0xC5
#define WDC_UNSUPPORTED_REQS_LOG_VERSION  0001
#define WDC_NUM_UNSUPPORTED_REQ_ENTRIES    253

struct __packed wdc_ocp_C5_unsupported_reqs {
	__le16  unsupported_count;                     /* 0000 - Number of Unsupported Requirement IDs              */
	__u8    rsvd1[14];                             /* 0002 - Reserved must be cleared to zero                   */
	__u8    unsupported_req_list[WDC_NUM_UNSUPPORTED_REQ_ENTRIES][16];  /* 0016 - Unsupported Requirements List */
	__u8    rsvd2[14];                             /* 4064 - Reserved must be cleared to zero                   */
	__le16  log_page_version;                      /* 4078 - Log Page Version                                   */
	__u8    log_page_guid[WDC_OCP_C5_GUID_LENGTH]; /* 4080 - Log Page GUID                                      */
};

static __u8 wdc_ocp_c5_guid[WDC_OCP_C5_GUID_LENGTH]    = { 0x2F, 0x72, 0x9C, 0x0E, 0x99, 0x23, 0x2C, 0xBB,
		0x63, 0x48, 0x32, 0xD0, 0xB7, 0x98, 0xBB, 0xC7 };

#define WDC_REASON_INDEX_MAX                    16
#define WDC_REASON_ID_ENTRY_LEN                128
#define WDC_REASON_ID_PATH_NAME                "/usr/local/nvmecli"

const char *log_page_name[256] = {
	[NVME_LOG_LID_ERROR]		= "Error Information",
	[NVME_LOG_LID_SMART]		= "SMART / Health Information",
	[NVME_LOG_LID_FW_SLOT]		= "Firmware Slot Information",
	[NVME_LOG_LID_CHANGED_NS]	= "Changed Namespace List",
	[NVME_LOG_LID_CMD_EFFECTS]	= "Command Supported and Effects",
	[NVME_LOG_LID_TELEMETRY_HOST]	= "Telemetry Host-Initiated",
	[NVME_LOG_LID_TELEMETRY_CTRL]	= "Telemetry Controller-Initiated",
	[NVME_LOG_LID_SANITIZE]		= "Sanitize Status",
	[WDC_LOG_ID_C0]			= "Extended SMART Information",
